dcustura/cyd-morse-trainer/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"

# ESP32-2432S028R (Cheap Yellow Display): 4MB flash, custom partition table
# (see partitions.csv) since LVGL + esp_lcd + touch driver code is close to
# the default ~1MB factory app partition ceiling.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# paddle_input's keyer-sampling task needs genuine 1ms granularity
# (vTaskDelay(pdMS_TO_TICKS(1))); the default 100Hz tick makes pdMS_TO_TICKS(1)
# round down to 0, turning the delay into a no-op that starves the idle task
# and trips the watchdog.
CONFIG_FREERTOS_HZ=1000

# Fixed-width fonts (both generated from the same unscii-8.ttf source, same
# 0x20-0x7F ASCII glyph range, just rendered at different pixel sizes):
# - unscii_8: Settings screen's numeric popup/tile value labels, and the
#   Practice screen's decoded text when "Small" text size is selected.
# - unscii_16: Practice screen's decoded text when "Large" text size is
#   selected; fixed-width keeps the erase-stack/line-wrap logic in
#   main/ui_practice.c simple (see comments there).
CONFIG_LV_FONT_UNSCII_8=y
CONFIG_LV_FONT_UNSCII_16=y

# The Practice screen's decoded-text area accumulates a long, spaceless run
# of characters between word gaps; LVGL's default (0 = disabled) never
# force-breaks a "word" regardless of length, so that whole run refuses to
# wrap until the next space. Break within any run longer than 1 character
# instead, so lines fill the display width like a plain character grid.
CONFIG_LV_TXT_LINE_BREAK_LONG_LEN=1
CONFIG_LV_TXT_LINE_BREAK_LONG_PRE_MIN_LEN=1
CONFIG_LV_TXT_LINE_BREAK_LONG_POST_MIN_LEN=1

# Redraw at ~60fps instead of LVGL's default ~30fps (33ms). The SPI clock
# (see display_init.c) and draw buffer size are the other limits on actual
# paint throughput; this just lets LVGL invalidate/flush more often.
CONFIG_LV_DEF_REFR_PERIOD=16
